       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG0.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. i486.
       OBJECT-COMPUTER. i486.
       SPECIAL-NAMES.
           CLASS WS-VALID-EMAIL IS
          '@' '_' '.'
          'a' THRU 'i'
          'j' THRU 'r'
          's' THRU 'z'
          '0' THRU '9'.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NAME-ADDRESS-FILE
                ASSIGN TO "C:\TMP\SAMPIN.TXT"
                ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRINT-FILE
                ASSIGN TO "C:\TMP\SAMPOUT.TXT".
      *  This next is only needed if the program is to sort a file.
           SELECT SORT-FILE-NAME
                ASSIGN TO "C:\TMP\SORT.TMP".
       END PROGRAM PRG0.
      