       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG0.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. i486.
       OBJECT-COMPUTER. i486.
       SPECIAL-NAMES.
           CLASS WS-VALID-EMAIL IS
          '@' '_' '.'
          'a' THRU 'i'
          'j' THRU 'r'
          's' THRU 'z'
          '0' THRU '9'.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NAME-ADDRESS-FILE
                ASSIGN TO "C:\TMP\SAMPIN.TXT"
                ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRINT-FILE
                ASSIGN TO "C:\TMP\SAMPOUT.TXT".
      *  This next is only needed if the program is to sort a file.
           SELECT SORT-FILE-NAME
                ASSIGN TO "C:\TMP\SORT.TMP".
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  MyADDRESS.
           05 ADDRESS-LINE-1         PIC X(40).
           05 ADDRESS-LINE-2.
              10 CITY                PIC X(17).
              10 STATE               PIC XX.
              10 FILLER              PIC X.
              10 ZIP1                PIC 9(5).
              10 FILLER              PIC X
                   VALUE IS "-".
              10 ZIP2                PIC 9(4).

       EXEC SQL
         INCLUDE SQLCA
       END-EXEC.

       01 DISP-RATE PIC $$$,$$$,$$9.99.
       01 DISP-COM PIC Z.99.
       01 DISP-CODE PIC ----9.
       01 FAKE-CHAR PIC X.
       01 ANSS PIC X.
       01 COM-NULL-IND PIC S9(4) COMP.

       EXEC SQL
        INCLUDE SQLCA
       END-EXEC.

       PROCEDURE DIVISION.
       DECLARE FUNCTION ReturnsZero PRIVATE
             RETURNING result PIC 9(04).
       DATA DIVISION.
       PROCEDURE DIVISION.
           MOVE 0 TO result.
           .
       END-DECLARE.

       DECLARE FUNCTION StrangelyReturnsItsInput PRIVATE
             INPUT     x      PIC 9(04)
             RETURNING result PIC 9(04)
           .
       DATA DIVISION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           IF x = 0
             MOVE 0 TO result
           ELSE
             MOVE x TO result
           END-IF.
       END-DECLARE.

       ILLEGAL-NON-FUNCTION-PARAGRAPH.
           CONTINUE.

       END PROGRAM PRG0.
